hybridPorousFoam-tutorials/Free_Flow_Cases/Bretherton/standard_Boundary/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       42204;
    }
    left
    {
        type            patch;
        nFaces          76;
        startFace       42484;
    }
    right
    {
        type            patch;
        nFaces          76;
        startFace       42560;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       42636;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42560;
        startFace       42916;
    }
)

// ************************************************************************* //
